tutorials/Matyas/channelCaseConstructor2D/10_baseCaseVSpaciV4/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//application     flowDCRcoupleNew;
// application     nonIsoFlowDCR;
application     reactingHetCatSimpleFoamPMT;
// application     rhoPorousSimpleFoam;

startFrom       latestTime;

startTime 	0;

stopAt          endTime;
//stopAt          writeNow;

endTime	2000;

deltaT          1;

writeControl    timeStep;

writeInterval 	500;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //

functions
{
      #include "residuals"
}
